BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega64C1.PIC
        <edc:SFRDef edc:_addr="0xCA" edc:access="----nnnn" edc:cname="LINENIR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LENRXOK" edc:desc="Enable Receive Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LENTXOK" edc:desc="Enable Transmit Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LENIDOK" edc:desc="Enable Identifier Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LENERR" edc:desc="Enable Error Interrupt" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCB" edc:access="nnnnnnnn" edc:cname="LINERR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LBERR" edc:desc="Bit Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCERR" edc:desc="Checksum Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LPERR" edc:desc="Parity Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSERR" edc:desc="Synchronization Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LFERR" edc:desc="Framing Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LOVERR" edc:desc="Overrun Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LTOERR" edc:desc="Frame Time Out Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LABORT" edc:desc="Abort Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCC" edc:access="n-nnnnnn" edc:cname="LINBTR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LBT" edc:desc="LIN Bit Timing bits" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="LDISR" edc:desc="Disable Bit Timing Resynchronization" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCD" edc:access="nnnnnnnn" edc:cname="LINBRRL" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDIV" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCE" edc:access="----nnnn" edc:cname="LINBRRH" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDIV" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCF" edc:access="nnnnnnnn" edc:cname="LINDLR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LRXDL" edc:desc="LIN Receive Data Length bits" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="LTXDL" edc:desc="LIN Transmit Data Length bits" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD0" edc:access="nnnnnnnn" edc:cname="LINIDR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LID" edc:desc="Identifier bit 5 or Data Length bits" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="LP" edc:desc="Parity bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD1" edc:access="----nnnn" edc:cname="LINSEL" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LINDX" edc:desc="FIFO LIN Data Buffer Index bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="LAINC" edc:desc="Auto Increment of Data Buffer Index (Active Low)" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD2" edc:access="nnnnnnnn" edc:cname="LINDAT" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDATA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD3" edc:offset="0x5"/>
        <edc:SFRDef edc:_addr="0xD8" edc:access="nnnnnnnn" edc:cname="CANGCON" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWRES" edc:desc="Software Reset Request" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENASTB" edc:desc="Enable / Standby" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TEST" edc:desc="Test Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LISTEN" edc:desc="Listening Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNTTC" edc:desc="Synchronization of TTC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TTC" edc:desc="Time Trigger Communication" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVRQ" edc:desc="Overload Frame Request" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABRQ" edc:desc="Abort Request" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD9" edc:access="-n-nnnnn" edc:cname="CANGSTA" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERRP" edc:desc="Error Passive Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOFF" edc:desc="Bus Off Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENFG" edc:desc="Enable Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXBSY" edc:desc="Receiver Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBSY" edc:desc="Transmitter Busy" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OVFG" edc:desc="Overload Frame Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDA" edc:access="nnnnnnnn" edc:cname="CANGIT" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AERG" edc:desc="Ackknowledgement Error General Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERG" edc:desc="Form Error General Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CERG" edc:desc="CRC Error General Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SERG" edc:desc="Stuff Error General Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BXOK" edc:desc="Burst Receive Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVRTIM" edc:desc="Overrun CAN Timer Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOFFIT" edc:desc="Bus Off Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CANIT" edc:desc="General Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDB" edc:access="nnnnnnnn" edc:cname="CANGIE" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ENOVRT" edc:desc="Enable CAN Timer Overrun Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENERG" edc:desc="Enable General Error Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENBX" edc:desc="Enable Burst Receive Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENERR" edc:desc="Enable MOb Error Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENTX" edc:desc="Enable Transmitt Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENRX" edc:desc="Enable Receive Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENBOFF" edc:desc="Enable Bus Off Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ENIT" edc:desc="Enable all Interrupts" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDC" edc:access="--nnnnnn" edc:cname="CANEN2" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ENMOB" edc:desc="Enable MObs" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDD" edc:access="nnnnnnnn" edc:cname="CANEN1" edc:nzwidth="0x8" ltx:memberofperipheral="CAN"/>
        <edc:SFRDef edc:_addr="0xDE" edc:access="--nnnnnn" edc:cname="CANIE2" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IEMOB" edc:desc="Interrupt Enable  MObs" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDF" edc:access="nnnnnnnn" edc:cname="CANIE1" edc:nzwidth="0x8" ltx:memberofperipheral="CAN"/>
        <edc:SFRDef edc:_addr="0xE0" edc:access="--nnnnnn" edc:cname="CANSIT2" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SIT" edc:desc="Status of Interrupt MObs" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE1" edc:access="nnnnnnnn" edc:cname="CANSIT1" edc:nzwidth="0x8" ltx:memberofperipheral="CAN"/>
        <edc:SFRDef edc:_addr="0xE2" edc:access="-nnnnnn-" edc:cname="CANBT1" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="BRP" edc:desc="Baud Rate Prescaler bits" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE3" edc:access="-nn-nnn-" edc:cname="CANBT2" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PRS" edc:desc="Propagation Time Segment bits" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SJW" edc:desc="Re-Sync Jump Width bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
